InformationRegisters/__СостояниеСеансовВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеСеансовВебСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Восстановление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__ЗначенияСеансовВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__ЗначенияСеансовВебСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примитивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПримитивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннееЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостояниеСеансовВебСервиса/Ext/ManagerModule.bsl
Функция ДобавитьСеанс(Параметры, Восстановление) Экспорт
	
	// Запись сеанса.
	Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Новый УникальныйИдентификатор;
	
	// Параметры.
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	Запись.Восстановление = Восстановление;
	
	// Поиск сеанса.
	Если Восстановление Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	__СостояниеСеансовВебСервиса.Идентификатор
		                      |ИЗ
		                      |	РегистрСведений.__СостояниеСеансовВебСервиса КАК __СостояниеСеансовВебСервиса
		                      |ГДЕ
		                      |	__СостояниеСеансовВебСервиса.ГруппаПользователей = &ГруппаПользователей
		                      |	И __СостояниеСеансовВебСервиса.Пользователь = &Пользователь
		                      |	И __СостояниеСеансовВебСервиса.Восстановление
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	__СостояниеСеансовВебСервиса.ДатаОкончанияПериода УБЫВ,
		                      |	__СостояниеСеансовВебСервиса.ДатаНачалаПериода УБЫВ");
		Запрос.УстановитьПараметр("Пользователь", Запись.Пользователь);					  
		Запрос.УстановитьПараметр("ГруппаПользователей", Запись.ГруппаПользователей);					  
		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли; 
	
	// Запись сеанса.
	Запись.Записать(Истина);
	
	// Восстаовление сеанса.
	Если Восстановление Тогда
		Если Выборка.Следующий() Тогда
			
			РегистрыСведений.__ЗначенияСеансовВебСервиса.ПередатьЗначенияСеансов(Выборка.Идентификатор, Запись.Идентификатор);
			УдалитьСеанс(Выборка.Идентификатор);
		
		КонецЕсли;
	КонецЕсли;
	
	// ERR.
	
	Возврат Запись.Идентификатор;
	
КонецФункции // ДобавитьСеанс()

Функция ПолучитьСеанс(Идентификатор, АвтоматическоеПродление = Ложь) Экспорт 
	
	// Получение сеанса.
	Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	
	// Проверка сеанса.
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение __ЛокализацияКлиентСервер.ИсключениеСеансНеНайден();
	КонецЕсли;
	
	// Продление сеанса.
	Если АвтоматическоеПродление Тогда
		Запись.Записать(Истина);
	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции // ПолучитьСеанс()

Процедура ИзменитьСеанс(Идентификатор, Параметры) Экспорт
	
	// Получение сеанса.
	Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	
	// Проверка сеанса.
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение __ЛокализацияКлиентСервер.ИсключениеСеансНеНайден();
	КонецЕсли;
	
	// Параметры.
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	
	Запись.Записать(Истина);
	
КонецПроцедуры // ИзменитьСеанс()

Процедура ПродлитьСеанс(Идентификатор) Экспорт
	
	// Продление сеанса.
	Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	
	// Проверка сеанса.
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение __ЛокализацияКлиентСервер.ИсключениеСеансНеНайден();
	КонецЕсли;
	
	Запись.Записать(Истина);
	
КонецПроцедуры // ПродлитьСеанс()

Процедура УдалитьСеанс(Идентификатор) Экспорт
	
	// Продление сеанса.
	Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Удалить();
	
	// Удаление связанных данных.
	РегистрыСведений.__ЗначенияСеансовВебСервиса.ОчиститьЗначенияСеансов(Идентификатор, Истина);
	
КонецПроцедуры // УдалитьСеанс()


Процедура ОчиститьСеансы(Полностью = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	__СостояниеСеансовВебСервиса.Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.__СостояниеСеансовВебСервиса КАК __СостояниеСеансовВебСервиса
	                      |ГДЕ
	                      |	(&Полностью
	                      |			ИЛИ __СостояниеСеансовВебСервиса.ДатаОкончанияПериода < &ДатаОкончанияПериода)");
	Запрос.УстановитьПараметр("Полностью", Полностью);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", РегистрыСведений.__НастройкиВебСервиса.ПолучитьГраницуХраненияНеактивнныхСенасов());
	РузультатЗапроса = Запрос.Выполнить();
	
	Если Не РузультатЗапроса.Пустой() Тогда
		
		// Удаление данных.
		Запись = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();
		
		Выборка = РузультатЗапроса.Выбрать(); Пока Выборка.Следующий() Цикл
			Запись.Идентификатор = Выборка.Идентификатор;
			Попытка
				Запись.Удалить();
			Исключение
				// ERR
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	// Удаление связанных данных.
	РегистрыСведений.__ЗначенияСеансовВебСервиса.ОчиститьЗначенияСеансов(Неопределено, Полностью);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОчиститьСеансы()
